/*
출처 : 윌텍(codexpert.ort/willtek)

<문제>
가로, 세로의 크기가 각각 100인 정사각형 모양의 흰색 도화지가 있다. 이 도화지 위에 가로, 세로의 크기가 각각 
10인 정사각형 모양의 검은색 색종이를 색종이의 변과 도화지의 변이 평행하도록 붙인다. 이러한 방식으로 색종이를
한 장 또는 여러 장 붙인 후 색종이가 붙은 검은 영역의 둘레의 길이를 구하는 프로그램을 작성하시오.

<입력>
첫째 줄에 색종이의 수가 주어진다. 이어 둘째 줄부터 한 줄에 하나씩 색종이를 붙인 위치가 주어진다. 
색종이를 붙인 위치는 두 개의 자연수로 주어지는데 첫 번째 자연수는 색종이의 왼쪽 변과 도화지의 왼쪽 변 사이의 거리이고,
두 번째 자연수는 색종이의 아래쪽 변과 도화지의 아래쪽 변 사이의 거리이다. 색종이의 수는 100이하이며, 
색종이가 도화지 밖으로 나가는 경우는 없다.

<출력>
첫째 줄에 색종이가 붙은 검은 영역의 둘레의 길이를 출력한다.
*/

#include <stdio.h>
#pragma warning (disable:4996)

char paper[100 + 5][100 + 5];
int x[100];
int y[100];

int main()
{
	int N;
	int i, j, k;
	int len = 0;

	scanf("%d", &N);
	for (i = 0; i < N; i++) {
		scanf("%d %d", &x[i], &y[i]);
	}

	for (k = 0; k < N; k++) {
		for (i = x[k]; i < x[k] + 10; i++) {
			for (j = y[k]; j < y[k] + 10; j++) {
				paper[i][j]++;
			}
		}
	}

	for (i = 0; i < 100; i++) {
		for (j = 0; j < 100; j++) {
			if (paper[i][j] != 0) {
				len += (!(paper[i + 1][j]) + !(paper[i - 1][j]) + !(paper[i][j - 1]) + !(paper[i][j + 1]));
			}
		}
	}

	printf("%d", len);
	return 0;
}
